app/controllers/pages_controller.rb

  def profile
    #grab the username from user and url

    if (User.find_by_username(params[:id]))
    @username = params[:id]
  else
    redirect_to root_path, :notice => "User Not found"
  end
@posts= Post.all.where("user_id = ?",User.find_by_username(params[:id]))
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "sfstanley2123"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 2)  ORDER BY "posts"."created_at" DESC

  def explorer
    @posts =Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC